Repository: G470/g470_security
Catalog: languages/g470-gatonet-plugins-*.po
Languages: de_de, it_it

source: G470 Security
de_de: G470 Sicherheit
it_it: G470 Sicurezza

source: You do not have sufficient permissions to access this page.
de_de: Sie verfügen nicht über ausreichende Berechtigungen, um auf diese Seite zuzugreifen.
it_it: Non disponi delle autorizzazioni sufficienti per accedere a questa pagina.

source: General Settings
de_de: Allgemeine Einstellungen
it_it: Impostazioni Generali

source: Available Patches
de_de: Verfügbare Patches
it_it: Patch Disponibili

source: Security check failed.
de_de: Sicherheitsprüfung fehlgeschlagen.
it_it: Controllo di sicurezza fallito.

source: Insufficient permissions.
de_de: Unzureichende Berechtigungen.
it_it: Autorizzazioni insufficienti.

source: Invalid module ID.
de_de: Ungültige Modul-ID.
it_it: ID modulo non valido.

source: Module toggled successfully.
de_de: Modul erfolgreich umgeschaltet.
it_it: Modulo attivato/disattivato con successo.

source: Failed to toggle module. It may be locked.
de_de: Modul konnte nicht umgeschaltet werden. Es könnte gesperrt sein.
it_it: Impossibile attivare/disattivare il modulo. Potrebbe essere bloccato.

source: Enable or disable security patches/modules. Some modules may have additional configuration options.
de_de: Aktivieren oder deaktivieren Sie Sicherheits-Patches/Module. Einige Module haben möglicherweise zusätzliche Konfigurationsoptionen.
it_it: Abilita o disabilita patch/moduli di sicurezza. Alcuni moduli potrebbero avere opzioni di configurazione aggiuntive.

source: Core module (cannot be disabled)
de_de: Kernmodul (kann nicht deaktiviert werden)
it_it: Modulo principale (non può essere disabilitato)

source: Always Active
de_de: Immer aktiv
it_it: Sempre Attivo

source: Enabled
de_de: Aktiviert
it_it: Abilitato

source: Disabled
de_de: Deaktiviert
it_it: Disabilitato

source: Configure Settings
de_de: Einstellungen konfigurieren
it_it: Configura Impostazioni

source: Failed to toggle module.
de_de: Modul konnte nicht umgeschaltet werden.
it_it: Impossibile attivare/disattivare il modulo.

source: An error occurred. Please try again.
de_de: Ein Fehler ist aufgetreten. Bitte versuchen Sie es erneut.
it_it: Si è verificato un errore. Riprova.

source: No modules available.
de_de: Keine Module verfügbar.
it_it: Nessun modulo disponibile.

source: ← Back to Patches
de_de: ← Zurück zu Patches
it_it: ← Torna alle Patch

source: No settings available for this module.
de_de: Für dieses Modul sind keine Einstellungen verfügbar.
it_it: Nessuna impostazione disponibile per questo modulo.

source: REST Users Endpoint Protection
de_de: REST-Benutzer-Endpunkt-Schutz
it_it: Protezione Endpoint Utenti REST

source: Enable Protection
de_de: Schutz aktivieren
it_it: Abilita Protezione

source: Required Capability
de_de: Erforderliche Berechtigung
it_it: Capacità Richiesta

source: Plugin Update Settings
de_de: Plugin-Update-Einstellungen
it_it: Impostazioni Aggiornamento Plugin

source: GitHub Repository
it_it: Repository GitHub

source: GitHub Token
it_it: Token GitHub

source: Restrict access to /wp/v2/users REST endpoint
de_de: Zugriff auf /wp/v2/users REST-Endpunkt einschränken
it_it: Limita l'accesso all'endpoint REST /wp/v2/users

source: Users must have this capability to access the users endpoint.
de_de: Benutzer müssen über diese Berechtigung verfügen, um auf den Benutzer-Endpunkt zuzugreifen.
it_it: Gli utenti devono avere questa capacità per accedere all'endpoint utenti.

source: Configure GitHub repository for automatic plugin updates. Leave blank to disable.
de_de: Konfigurieren Sie das GitHub-Repository für automatische Plugin-Updates. Leer lassen, um zu deaktivieren.
it_it: Configura il repository GitHub per gli aggiornamenti automatici del plugin. Lasciare vuoto per disabilitare.

source: Full GitHub repository URL (e.g., https://github.com/yourusername/g470_security)
de_de: Vollständige GitHub-Repository-URL (z.B. https://github.com/benutzername/g470_security)
it_it: URL completo del repository GitHub (es. https://github.com/nomeutente/g470_security)

source: Optional. GitHub Personal Access Token (required for private repositories). Keep this secret!
de_de: Optional. GitHub Personal Access Token (erforderlich für private Repositorys). Geheim halten!
it_it: Opzionale. Token di Accesso Personale GitHub (richiesto per repository privati). Mantienilo segreto!

source: REST Users Protection
de_de: REST-Benutzer-Schutz
it_it: Protezione Utenti REST

source: Restrict access to /wp/v2/users REST endpoint based on capabilities.
de_de: Zugriff auf /wp/v2/users REST-Endpunkt basierend auf Berechtigungen einschränken.
it_it: Limita l'accesso all'endpoint REST /wp/v2/users in base alle capacità.

source: Sorry, you are not allowed to view the users endpoint.
de_de: Sie sind nicht berechtigt, den Benutzer-Endpunkt anzuzeigen.
it_it: Spiacente, non sei autorizzato a visualizzare l'endpoint utenti.

source: No release notes available.
de_de: Keine Versionshinweise verfügbar.
it_it: Nessuna nota di rilascio disponibile.

source: GitHub repository not configured.
de_de: GitHub-Repository nicht konfiguriert.
it_it: Repository GitHub non configurato.

source: GitHub API returned error code %d
de_de: GitHub API hat Fehlercode %d zurückgegeben
it_it: L'API GitHub ha restituito il codice di errore %d

source: Failed to decode GitHub API response.
de_de: GitHub API-Antwort konnte nicht dekodiert werden.
it_it: Impossibile decodificare la risposta dell'API GitHub.

source: Protection Mode
de_de: Schutzmodus
it_it: Modalità di Protezione

source: Block Access
de_de: Zugriff blockieren
it_it: Blocca Accesso

source: Completely block unauthorized users (returns 401/403 error)
de_de: Nicht autorisierte Benutzer vollständig blockieren (gibt 401/403-Fehler zurück)
it_it: Blocca completamente gli utenti non autorizzati (restituisce errore 401/403)

source: Sanitize Data
de_de: Daten anonymisieren
it_it: Anonimizza Dati

source: Allow access but replace sensitive information with generic placeholders
de_de: Zugriff erlauben, aber sensible Informationen durch allgemeine Platzhalter ersetzen
it_it: Consenti l'accesso ma sostituisci le informazioni sensibili con segnaposto generici

source: Choose how to protect the users endpoint. Block mode is more secure, but sanitize mode allows public access while hiding usernames and sensitive data.
de_de: Wählen Sie, wie der Benutzer-Endpunkt geschützt werden soll. Der Block-Modus ist sicherer, aber der Anonymisierungs-Modus erlaubt öffentlichen Zugriff und verbirgt gleichzeitig Benutzernamen und sensible Daten.
it_it: Scegli come proteggere l'endpoint utenti. La modalità blocco è più sicura, ma la modalità anonimizzazione consente l'accesso pubblico nascondendo i nomi utente e i dati sensibili.

source: User
de_de: Benutzer
it_it: Utente
